{"_id":{"$oid":"5c87437aaa4fc8201d3a2bc2"},"student_id":"UGMS6DUMT","time":"Tue Mar 12 2019 05:26:29 GMT+0000 (Coordinated Universal Time)","topic":"assignment","course_content":"201","prof_name":"Jane Smith","emoji_sentiment":"pos","response_good":"The instructions for each assignment have been very clear, which has helped keep me on the right track as I worked through each one.","response_bad":"It would be great to get feedback on assignments sooner, so I could learn from my mistakes and apply that to future assignments before they’re due.","response_add_feedback":"The links to assignments in ISVC are broken.","reponse_full":"The instructions for each assignment have been very clear, which has helped keep me on the right track as I worked through each one.It would be great to get feedback on assignments sooner, so I could learn from my mistakes and apply that to future assignments before they’re due.The links to assignments in ISVC are broken.","scale":"5"}
{"_id":{"$oid":"5c874ee5fb2cfe24a30f806e"},"student_id":"anon","time":"Tue Mar 12 2019 05:52:53 GMT+0000 (Coordinated Universal Time)","topic":"technology","course_content":"201","prof_name":"Jane Doe","emoji_sentiment":"pos","response_good":"I personally am a huge fan of Zoom, and I am so glad Zoom has officially replaced Adobe Connect in ISVC. Adobe Connect audio and video quality was my major concern and I am excited that I can have a great online classroom experience with the transition to Zoom.","response_bad":"It's not 100% clear to me when the assignments are due and where to submit them. I understand Jane's motivation to want to use GitHub but the information on GitHub is not in sync with the information on ISVC. If Jane can make sure everything is aligned and in agreement, that would be a huge help!","response_add_feedback":"Office hour Zoom recordings are incredibly helpful. I particularly like that I can benefit from a different instructors' office hours as well. Please continue to record office hours!","reponse_full":"I personally am a huge fan of Zoom, and I am so glad Zoom has officially replaced Adobe Connect in ISVC. Adobe Connect audio and video quality was my major concern and I am excited that I can have a great online classroom experience with the transition to Zoom. It's not 100% clear to me when the assignments are due and where to submit them. I understand Jane's motivation to want to use GitHub but the information on GitHub is not in sync with the information on ISVC. If Jane can make sure everything is aligned and in agreement, that would be a huge help! Office hour Zoom recordings are incredibly helpful. I particularly like that I can benefit from a different instructors' office hours as well. Please continue to record office hours!","scale":"6"}
{"_id":{"$oid":"5c875022fb2cfe24a30f806f"},"student_id":"anon","time":"Tue Mar 12 2019 05:52:53 GMT+0000 (Coordinated Universal Time)","topic":"technology","course_content":"203","prof_name":"Jane Doe","emoji_sentiment":"pos","response_good":"I personally am a huge fan of Zoom, and I am so glad Zoom has officially replaced Adobe connect in ISVC. Adobe connect audio and video quality was my major concern and I am excited that I can have a great online classroom experience with the transition to Zoom.","response_bad":"It’s not 100% clear to me when the assignments are due and where to submit them. I understand Jane’s motivation to want to use GitHub but the information on GitHub is not in sync with the information on ISVC. If jane can make sure everything is aligned and in agreement, that would be a huge help!","response_add_feedback":"Office hour Zoom recordings are incredibly helpful! I particularly like that I can benefit from a different instructors’ office hours as well. Please continue to record office hours.","reponse_full":"I personally am a huge fan of Zoom, and I am so glad Zoom has officially replaced Adobe connect in ISVC. Adobe connect audio and video quality was my major concern and I am excited that I can have a great online classroom experience with the transition to Zoom. It’s not 100% clear to me when the assignments are due and where to submit them. I understand Jane’s motivation to want to use GitHub but the information on GitHub is not in sync with the information on ISVC. If jane can make sure everything is aligned and in agreement, that would be a huge help! Office hour Zoom recordings are incredibly helpful! I particularly like that I can benefit from a different instructors’ office hours as well. Please continue to record office hours.","scale":"6"}
{"_id":{"$oid":"5c891c6043fc030069c287f6"},"student_id":"UGMS6DUMT","time":"Wed Mar 13 2019 15:03:56 GMT+0000 (Coordinated Universal Time)","topic":"technology","course_content":"201","prof_name":"Jane Smith","emoji_sentiment":"pos","response_good":"I personally am a huge fan of Zoom, and I am so glad Zoom has officially replaced Adobe Connect in ISVC. Adobe Connect audio and video quality was my major concern and I am excited that I can have a great online classroom experience with the transition to Zoom.","response_bad":"It’s not 100% clear to me when the assignments are due and where to submit them. I understand Jane’s motivation to want to use GitHub but the information on GitHub is not in sync with the information on ISVC. If Jane can make sure everything is aligned and in agreement, that would be a huge help!","response_add_feedback":"Office hour Zoom recordings are incredibly helpful. I particularly like that I can benefit from different instructors’ office hours as well. Please continue to record office hours","reponse_full":"I personally am a huge fan of Zoom, and I am so glad Zoom has officially replaced Adobe Connect in ISVC. Adobe Connect audio and video quality was my major concern and I am excited that I can have a great online classroom experience with the transition to Zoom. It’s not 100% clear to me when the assignments are due and where to submit them. I understand Jane’s motivation to want to use GitHub but the information on GitHub is not in sync with the information on ISVC. If Jane can make sure everything is aligned and in agreement, that would be a huge help! Office hour Zoom recordings are incredibly helpful. I particularly like that I can benefit from different instructors’ office hours as well. Please continue to record office hours","scale":"6"}
{"_id":{"$oid":"5c89bc16d3014c00e8bb6e7c"},"student_id":"UGPP6T9DY","time":"Wed Mar 13 2019 15:27:26 GMT+0000 (Coordinated Universal Time)","topic":"live session","course_content":"210","prof_name":"Joyce Shen","emoji_sentiment":"neu","response_good":"Groups keep going over their alotted time to present and the instructors don't interceed.","response_bad":"I'd ask them to be more strict and maybe tell the students when they have 5 and 1 minute left","response_add_feedback":"I'd ask them to cut the groups off when they exceed their time","reponse_full":"Groups keep going over their alotted time to present and the instructors don't interceed. I'd ask them to be more strict and maybe tell the students when they have 5 and 1 minute left I'd ask them to cut the groups off when they exceed their time","scale":"5"}
